/*

    题目：取一个整数a从右端开始的4～7位。 

*/

#include <stdio.h>

int main(int argc, char const *argv[])
{
	unsigned a,b,c,d; 
	scanf("%o",&a); //  二进制     八进制    
					//0011 1111  --  77  --  a
	b=a>>4; 		//0000 0011  --  3   --  b
	printf("b=a>>4=%o\n", b);

	c=~(~0<<4);    
					//0000 0000  --  00  --  0
					//1111 1111  --  377 --  ~0
					//1111 0000  --  360 --  ~0<<4
					//0000 1111  --  17  --  ~(~0<<4)

	printf("~0=%x\n", ~0);
	printf("~0<<4=%x\n", ~0<<4);
    printf("c=~(~0<<4)=%o\n", ~(~0<<4));

	d=b&c; 
					//0000 0011  --  3  --  b
					//0000 1111  --  17 --  c
					//0000 0011  --  3  --  d=b&c
	printf("d=b&c=%o\n", d);
	printf("%o\n%o\n",a,d); 

	return 0;
}